---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.SiteFailures.NoHostForSubregionWarn
source: html/83588d15-303f-997d-20ac-268d60fdfdb0.htm
---
# Autodesk.Revit.DB.BuiltInFailures.SiteFailures.NoHostForSubregionWarn Property

This Subregion now does not appear to overlap any Toposurface with an appropriate Phase and Design Option.

## Syntax (C#)
```csharp
public static FailureDefinitionId NoHostForSubregionWarn { get; }
```